<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Detours d'objets</title>
<script src="flowplayer/flowplayer-3.1.4.min.js"></script> 
</head>
<style type="text/css">
@import url("MesCss.css");
</style>
<body>
<script language="JavaScript"> 
    flowplayer("player", "flowplayer/flowplayer-3.1.5.swf"); 
</script> 

 <H1 class="TitreBleu">Installation interactive Dior</H1>
  	  <H1 class="TexteNoir">2011        pour Soixante circuits</H1>
  	  <p><img src="images/portfolio/dior.jpg" width="200" height="200"><BR>
  	      <span class="TexteNoir"><BR>
          </span></p>
<p class="TexteNoir"><strong>Type de projet : </strong>Freelance</p>
  	  <p class="TexteNoir"><strong>Technologie :</strong> C++, CINDER, GLSL, MAC OS</p>
  	  <p class="TexteNoir"><strong>Travail :</strong> D&eacute;veloppement</p>
<p class="TexteNoir"><strong>Description :</strong></p>
  	  <p class="TexteNoir">Cette installation est compos&eacute;e d'un Ipad pour l'interface graphique et du serveur qui projete en hologramme  le sac &agrave; main Dior. </p>
  	  <p class="TexteNoir">Avec l'ipad vous pouvez choisir la texture et la couleur du sac :</p>
  	  <p class="TexteNoir"><img src="images/portfolio/iPad006.jpg" alt="" width="400" height="300" /></p>
  	  <p class="TexteNoir">Une autre page permet de mettre des images sur le sac :</p>
  	  <p class="TexteNoir"><img src="images/portfolio/iPad010.jpg" alt="" width="400" height="300" /></p>
  	  <p class="TexteNoir">Ensuite &agrave; la page suivante un compte &agrave; rebours se met en place et une photo de vous est prise avec une incrustation du sac personnalis&eacute; sur votre main. L'image r&eacute;sultat est affich&eacute; sur l'ipad et ensuite envoy&eacute; par email. Vous devez donc remplir un petit formulaire pour que l'image vous soit envoy&eacute;e.</p>
  	  <p class="TexteNoir">Le serveur est compos&eacute; d'un sac qui tourne sur lui m&ecirc;me. Il est par d&eacute;faut en mode filaire. Ensuite vous pouvez changer la texture et la couleur en fonction de votre choix sur l'interface graphique. Si vous mettez des images sur le sac ils s'y mettent et le sac s'arr&ecirc;te de tourner. Pour finir, une photo est prise avec une webcam en HD et le sac personnalis&eacute; se met par dessus la photo ensuite l'image est enregistr&eacute;e et envoy&eacute; sur l'ipad.</p>
  	  <p class="TexteNoir">&nbsp;</p>
<p class="TexteNoir"><strong>T&acirc;ches :</strong></p>
  	  <UL>
        <LI>
        <p class="TexteNoir">D&eacute;veloppeur C++ avec la librairie CINDER de l'application de rendu de sac en temps r&eacute;el.</p>        
        <LI><span class="TexteNoir">D&eacute;veloppement de shaders GLSL de normal mapping pour la lumi&egrave;re, de bump mapping pour le relief, de sph&egrave;re mapping pour le rendu m&eacute;tallique pour les pi&egrave;ces en m&eacute;tal.        </span>        
        <LI><span class="TexteNoir">D&eacute;veloppement de la mise en page de l'image prise par la webcam et du sac personnalis&eacute; qui vient se mettre dans les mains du spectateur.</span>
</UL>
<p>&nbsp;</p>
</body>
</html>